home-n-links.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-31 Fri 07:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>/home/n/links</title>
<meta name="author" content="Roi Martin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">/home/n/links</h1>
<p>
In October 2018 I started a Telegram channel named <b>/home/n/links</b> to
share interesting links with my friends. However, I never really liked
that way of sharing content. So, I decided to close the Telegram
channel and start using this page.
</p>

<p>
If you want to receive notifications when this page is updated, use
this <a href="https://github.com/jroimartin/wip.jroi.dev/commits/main/home-n-links.html.atom">RSS feed</a>.
</p>

<div id="outline-container-org1a709c7" class="outline-2">
<h2 id="org1a709c7">May 2024</h2>
<div class="outline-text-2" id="text-org1a709c7">
<ul class="org-ul">
<li><a href="https://youtu.be/DDROSL-gGOo?feature=shared">Unlock Lisp / Scheme's magic: beginner to Scheme-in-Scheme in one hour</a> by Christine Lemmer-Webber</li>
</ul>
</div>
</div>

<div id="outline-container-org099a7a2" class="outline-2">
<h2 id="org099a7a2">December 2023</h2>
<div class="outline-text-2" id="text-org099a7a2">
<ul class="org-ul">
<li><a href="https://commandcenter.blogspot.com/2023/12/simplicity.html">Simplicity</a> by Rob Pike</li>
<li><a href="https://youtu.be/6H-V-0oQvCA">Open Source Supply Chain Security at Google</a> by Russ Cox</li>
</ul>
</div>
</div>

<div id="outline-container-org326994c" class="outline-2">
<h2 id="org326994c">October 2023</h2>
<div class="outline-text-2" id="text-org326994c">
<ul class="org-ul">
<li><a href="https://journal.stuffwithstuff.com/2023/10/19/does-go-have-subtyping/">Does Go Have Subtyping?</a> by Robert Nystrom</li>
</ul>
</div>
</div>

<div id="outline-container-orgf347e9a" class="outline-2">
<h2 id="orgf347e9a">July 2023</h2>
<div class="outline-text-2" id="text-orgf347e9a">
<ul class="org-ul">
<li><a href="https://research.swtch.com/pcdata">Storing Data in Control Flow</a> by Russ Cox</li>
<li><a href="https://research.swtch.com/coro">Coroutines for Go</a> by Russ Cox</li>
</ul>
</div>
</div>

<div id="outline-container-org59bdf0c" class="outline-2">
<h2 id="org59bdf0c">February 2023</h2>
<div class="outline-text-2" id="text-org59bdf0c">
<ul class="org-ul">
<li><a href="https://youtu.be/1I1WmeSjRSw">Pardon the Interruption: Loop Preemption in Go 1.14</a> by Austin Clements</li>
<li><a href="https://youtube.com/playlist?list=PLxNYxgaZ8Rsf8PLPWeUPRA3iZoK9uu3lU">Go Day 2022</a> on Google Open Source Live</li>
</ul>
</div>
</div>

<div id="outline-container-org28a7597" class="outline-2">
<h2 id="org28a7597">December 2022</h2>
<div class="outline-text-2" id="text-org28a7597">
<ul class="org-ul">
<li><a href="https://youtu.be/g4SYTOc8fL0">Procedural Macros vs Sliced Bread</a> by Alex Crichton</li>
</ul>
</div>
</div>

<div id="outline-container-org1f95104" class="outline-2">
<h2 id="org1f95104">November 2022</h2>
<div class="outline-text-2" id="text-org1f95104">
<ul class="org-ul">
<li><a href="https://youtu.be/RqubKSF3wig">SQLite and Go</a> by David Crawshaw</li>
<li><a href="https://craftinginterpreters.com/">Crafting Interpreters</a> by Robert Nystrom (<a href="https://craftinginterpreters.com/contents.html">Read online</a>, <a href="http://journal.stuffwithstuff.com/2020/04/05/crafting-crafting-interpreters/">Crafting "Crafting Interpreters"</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org3549e1b" class="outline-2">
<h2 id="org3549e1b">October 2022</h2>
<div class="outline-text-2" id="text-org3549e1b">
<ul class="org-ul">
<li><a href="https://youtu.be/v24wrd3RwGo">Compatibility: How Go Programs Keep Working</a> by Russ Cox</li>
</ul>
</div>
</div>

<div id="outline-container-org1e10b4e" class="outline-2">
<h2 id="org1e10b4e">September 2022</h2>
<div class="outline-text-2" id="text-org1e10b4e">
<ul class="org-ul">
<li><a href="https://youtu.be/T4rKaqjUXXs">Hash Salehi Outsmarts His Smart Meter</a> on Remoticon 2021</li>
<li><a href="https://youtu.be/XmaT8bMssyQ">Uri Shaked Reverse Engineers ESP32 WiFi</a> on Remoticon 2021</li>
</ul>
</div>
</div>

<div id="outline-container-org5e7f599" class="outline-2">
<h2 id="org5e7f599">August 2022</h2>
<div class="outline-text-2" id="text-org5e7f599">
<ul class="org-ul">
<li><a href="https://blog.benjojo.co.uk/post/bgp-battleships">Playing battleships over BGP</a> by Ben Cox</li>
<li><a href="https://youtu.be/30jNsCVLpAE">Debugging Under Fire: Keep your Head when Systems have Lost their Mind</a> by Bryan Cantrill</li>
<li><a href="https://www.cs.princeton.edu/courses/archive/spr09/cos333/beautiful.html">A Regular Expression Matcher</a> by Rob Pike and Brian Kernighan</li>
</ul>
</div>
</div>

<div id="outline-container-orgbe4e419" class="outline-2">
<h2 id="orgbe4e419">July 2022</h2>
<div class="outline-text-2" id="text-orgbe4e419">
<ul class="org-ul">
<li><a href="https://youtu.be/_2NI6t2r_Hs">The History of Unix</a> by Rob Pike</li>
<li><a href="https://youtube.com/playlist?list=PLrwpzH1_9ufMLOB6BAdzO08Qx-9jHGfGg">"Unusual" solutions to Advent of Code</a> by Russ Cox</li>
<li><a href="https://youtu.be/oV9rvDllKEg">Concurrency is not Parallelism</a> by Rob Pike</li>
<li><a href="https://go.dev/blog/supply-chain">How Go Mitigates Supply Chain Attacks</a> by Filippo Valsorda</li>
</ul>
</div>
</div>

<div id="outline-container-org6f72af1" class="outline-2">
<h2 id="org6f72af1">June 2022</h2>
<div class="outline-text-2" id="text-org6f72af1">
<ul class="org-ul">
<li><a href="https://youtu.be/HxaD_trXwRE">Lexical Scanning in Go</a> by Rob Pike (<a href="https://go.googlesource.com/go/+/0e45890c8bafbaeed18c22f462d5435e43705264%5E%21/">CL</a>)</li>
<li><a href="https://mazzo.li/posts/fast-pipes.html">How fast are Linux pipes anyway?</a> by Francesco Mazzoli</li>
<li><a href="https://research.swtch.com/mm">Memory Models</a> by Russ Cox</li>
<li><a href="https://youtu.be/xxDZuPEgbBU">Profiling &amp; Optimizing in Go</a> by Brad Fitzpatrick</li>
<li><a href="https://youtu.be/EY6q5dv_B-o">Brian Kernighan interviews Ken Thompson</a></li>
</ul>
</div>
</div>

<div id="outline-container-org578b9a3" class="outline-2">
<h2 id="org578b9a3">June 2019</h2>
<div class="outline-text-2" id="text-org578b9a3">
<ul class="org-ul">
<li><a href="https://youtu.be/ZmZ_tvbhJ0I">A Keynote in Praise of Junk Hacking</a> by Travis Goodspeed</li>
</ul>
</div>
</div>

<div id="outline-container-org86a3016" class="outline-2">
<h2 id="org86a3016">January 2019</h2>
<div class="outline-text-2" id="text-org86a3016">
<ul class="org-ul">
<li>Detecting integer constant expressions in macros (<a href="https://lkml.org/lkml/2018/3/20/805">Mail-1</a>, <a href="https://lkml.org/lkml/2018/3/20/845">Mail-2</a>)</li>
<li><a href="https://youtu.be/RIvL2ONhFBI">Go 2 Draft Specifications</a> by Rob Pike</li>
</ul>
</div>
</div>

<div id="outline-container-org5c9886c" class="outline-2">
<h2 id="org5c9886c">November 2018</h2>
<div class="outline-text-2" id="text-org5c9886c">
<ul class="org-ul">
<li><a href="https://youtu.be/_eSAF_qT_FY">GOD MODE UNLOCKED - Hardware Backdoors in x86 CPUs</a> by Christopher Domas</li>
</ul>
</div>
</div>

<div id="outline-container-org915e630" class="outline-2">
<h2 id="org915e630">October 2018</h2>
<div class="outline-text-2" id="text-org915e630">
<ul class="org-ul">
<li><a href="https://youtu.be/rFejpH_tAHM">Simplicity is Complicated</a> by Rob Pike (<a href="https://talks.golang.org/2015/simplicity-is-complicated.slide">Slides</a>)</li>
<li><a href="https://www.youtube.com/watch?v=OyfBQmvr2Hc">The Most Beautiful Program Ever Written</a> by William Byrd</li>
<li><a href="https://youtu.be/KINIAgRpkDA">The Design of the Go Assembler</a> by Rob Pike (<a href="https://talks.golang.org/2016/asm.slide">Slides</a>)</li>
<li><a href="https://commandcenter.blogspot.com/2017/12/error-handling-in-upspin.html">Error handling in Upspin</a> by Rob Pike</li>
<li><a href="http://doc.cat-v.org/bell_labs/good_bad_ugly/slides.pdf">The Good, the Bad, and the Ugly: The Unix Legacy</a> by Rob Pike</li>
<li><a href="https://youtu.be/FITJMJjASUs">Y Not- Adventures in Functional Programming</a> by Jim Weirich</li>
<li><a href="https://lkml.org/lkml/2017/11/21/356">On hardening</a> by Linus Torvalds</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-05-29 Wed 00:00</p>
<p class="author">Author: Roi Martin</p>
<p class="date">Created: 2024-05-31 Fri 07:41</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
